Revit 2026 API

# NonContinuousRailInfoIsValidNonContinuousRailName Method

---

Checks whether the input name is valid for a non-continuous rail in its associated railing type.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsValidNonContinuousRailName(
	string name
)
```
```vb
Public Function IsValidNonContinuousRailName (
	name As String
) As Boolean
```
```cpp
public:
bool IsValidNonContinuousRailName(
	String^ name
)
```
```fsharp
member IsValidNonContinuousRailName :
        name : string -> bool
```

#### Parameters

name String
     The name to be checked.

#### Return Value

Boolean True if the name is unique for the [!:Autodesk::Revit::DB::Architecture::RailingType], false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The name must be unique within the [!:Autodesk::Revit::DB::Architecture::RailingType] to which the non-continuous rail belongs.

#### Reference

NonContinuousRailInfo Class

Autodesk.Revit.DB.Architecture Namespace